 
 Функция СозданиеДоговоровИРеализаций(ДатаНачала, ДатаОкончания)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Проведен
	               |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	               |	ВТ_ДанныеДокумента.Ссылка КАК Реализация
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ПО ВТ_ДанныеДокумента.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_ДанныеДокумента.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("Результат выборки из запроса пустой");
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СписокЗапроса = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл 
		
		СтруктураВыборки = Новый Структура;
		СтруктураВыборки.Вставить("Договор", Выборка.Договор);
		СтруктураВыборки.Вставить("Реализация", Выборка.Реализация);
		СписокЗапроса.Добавить(СтруктураВыборки);
		
	КонецЦикла;
	
	Возврат СписокЗапроса;
КонецФункции 
