#language: ru

@tree

Функционал: Массовое создание актов

Как Бухгалтер  я хочу
сформировать акты по всем абонентским договорам
  

Сценарий: Создание актов
Когда В командном интерфейсе я выбираю 'Добавленные объекты' 'Массовое создание актов'
Тогда открылось окно 'Массовое создание актов'
И я нажимаю кнопку выбора у поля с именем "ПЕРИОД"
Тогда открылось окно 'Выберите период'
И я нажимаю на кнопку с именем 'Select'
Тогда открылось окно 'Массовое создание актов'
И я нажимаю на кнопку с именем 'ФормаСоздатьСписок'
