#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаСумма = Элементы.Добавить("ГруппаСумма", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаСумма.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСумма.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаСумма.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"), ГруппаСумма);		
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Абонентская плата";	
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"), ГруппаСумма);		
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Стоимость часа";
	
	ГруппаПериод = Элементы.Добавить("ГруппаПериод", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПериод.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_НачалоС", Тип("ПолеФормы"), ГруппаПериод);		
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_НачалоС";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Дата начала";	
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_По", Тип("ПолеФормы"), ГруппаПериод);		
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_По";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Дата окончания";
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");	
	ОтображениеПоДоговору();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ОтображениеПоДоговору();
	
КонецПроцедуры

&НаСервере
Процедура ОтображениеПоДоговору()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Истина;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		Элементы.ВКМ_НачалоС.Видимость = Истина;
		Элементы.ВКМ_По.Видимость = Истина;		
	Иначе		
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Ложь;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
		Элементы.ВКМ_НачалоС.Видимость = Ложь;
		Элементы.ВКМ_По.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
