
#Область ОбработчикиСобытийФормы
  // {{ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 18.12.2023 ++
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры 

 // }}ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 18.12.2023 -- 
#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	// {{ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 18.12.2023 ++	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);	
	// }}ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 18.12.2023 --
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт 
	
	// {{ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 18.12.2023 ++	
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
	// }}ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 18.12.2023 --
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	
	// {{ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 18.12.2023 ++ 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
	// }}ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 18.12.2023 --
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	// {{ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 18.12.2023 ++	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
	// }}ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 18.12.2023 --
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
