
&НаКлиенте
Процедура СоздатьСписок(Команда)
	
	ДлительнаяОперация = ВыполнитьФоновоеЗаданиеНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьДанныеТабличнойЧасти", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ВКМ_СозданиеАктовВФоне.СозданиеДоговоровИРеализаций", 
	Объект.ПЕРИОД.ДатаНачала, Объект.ПЕРИОД.ДатаОкончания);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДанныеТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Сообщить("А =1");
	КонецЕсли;
	
	СписокЗапроса = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Объект.СписокДоговоровРеализаций.Очистить(); 
	
	Для Каждого Строка Из СписокЗапроса Цикл 
		
		НоваяСтрока = Объект.СписокДоговоровРеализаций.Добавить();
		НоваяСтрока.СписокДоговор = Строка.Договор;       
		НоваяСтрока.СписокРеализаций = Строка.Реализация;
		
	КонецЦикла;
КонецПроцедуры  



