
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ВКМ_ГрафикОтпусков 
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	Для Каждого ТекСтрока Из ВКМ_ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ТекСтрока.ВКМ_Сотрудник;
		Движение.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
		Движение.ВКМ_КоличествоДней = (ТекСтрока.ВКМ_ДатаОкончания - ТекСтрока.ВКМ_ДатаНачала) / 86400;
	КонецЦикла;

КонецПроцедуры
