
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;			
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		
		// регистр ВКМ_ДополнительныеНачисления
		ДвижениеДоп = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеДоп.Сторно = Ложь;
		ДвижениеДоп.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		ДвижениеДоп.ПериодРегистрации = Дата;
		ДвижениеДоп.ВКМ_Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		ДвижениеДоп.ВКМ_Сумма = ТекСтрокаСписокСотрудников.СуммаПремии;		
		
		// регистр ВКМ_Удержания
		ДвижениеУд = Движения.ВКМ_Удержания.Добавить();
		ДвижениеУд.ПериодРегистрации = Дата;
		ДвижениеУд.ВКМ_Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		ДвижениеУд.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеУд.ВКМ_Сумма = (ДвижениеДоп.ВКМ_Сумма * 13) / 100;			
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	СформироватьВзаиморасчётыССотрудниками();
		
КонецПроцедуры
		
Процедура СформироватьВзаиморасчётыССотрудниками()
	  
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого Строка Из СписокСотрудников Цикл
		Сумма = ВКМ_РасчетПоВзаиморасчетам.ЗП_ПоВзаиморасчетам(Ссылка);
		Если Сумма > 0 Тогда
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
			Движение.ВКМ_Сотрудник = Строка.Сотрудник;
			Движение.ВКМ_Сумма = Сумма;
		КонецЕсли;
		
	КонецЦикла; 
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(); 
	  
  КонецПроцедуры