
Функция ЗП_ПоВзаиморасчетам(Ссылка) Экспорт

    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ВКМ_ОсновныеНачисления.ВКМ_Сумма), 0) КАК ОсновныеНачисления
	               |ПОМЕСТИТЬ ВТ_ОснНач
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	               |ГДЕ
	               |	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ВКМ_ДополнительныеНачисления.ВКМ_Сумма), 0) КАК ДопНачисления
	               |ПОМЕСТИТЬ ВТ_ДопНач
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ВКМ_Удержания.ВКМ_Сумма), 0) КАК Удержания
	               |ПОМЕСТИТЬ ВТ_Удержания
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	               |ГДЕ
	               |	ВКМ_Удержания.Регистратор = &Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОснНач.ОсновныеНачисления КАК ОсновныеНачисления,
	               |	ВТ_ДопНач.ДопНачисления КАК ДопНачисления,
	               |	ВТ_Удержания.Удержания КАК Удержания
	               |ИЗ
	               |	ВТ_ОснНач КАК ВТ_ОснНач,
	               |	ВТ_ДопНач КАК ВТ_ДопНач,
	               |	ВТ_Удержания КАК ВТ_Удержания"; 
			
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
    Выборка = Запрос.Выполнить().Выбрать();
	
    	Если Выборка.Количество() = 0 Тогда
		Возврат 0;
	Иначе		
        Выборка.Следующий(); 
		Сумма = Выборка.ОсновныеНачисления + Выборка.ДопНачисления - Выборка.Удержания; 
		Возврат Сумма;
	КонецЕсли;

КонецФункции
