
Процедура ОтправитьСообщениеВТелеграм()Экспорт
	
	// Получаем ссылку на справочник "ВКМ_Уведомление_TG_Боту"
	СсылкаНаРеквизит = Справочники.ВКМ_Уведомление_TG_Боту.Выбрать();	
	
	// Цикл по элементам справочника "Уведомления"
	Пока СсылкаНаРеквизит.Следующий() Цикл
		Если ЗначениеЗаполнено(СсылкаНаРеквизит.Текст) Тогда 
			
			Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
			chat_id = Константы.ВКМ_ИдентификаторГруппыОповещения.Получить();
			
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
			Соединение = Новый HTTPСоединение("api.telegram.org", 443,,,,, ЗащищенноеСоединение);
			
			ЗапросHTTP = Новый HTTPЗапрос;
			ЗапросHTTP.Заголовки.Вставить("Content-Type", "application/json");
			ЗапросHTTP.АдресРесурса = "bot" + Токен + "/sendMessage?chat_id=" + chat_id + "&text=" + СсылкаНаРеквизит.Текст;
			Соединение.Получить(ЗапросHTTP); 
			
			// Получаем и удаляем элемент справочника после отправки уведомления
			СообщенияСправочника = СсылкаНаРеквизит.ПолучитьОбъект();
			СообщенияСправочника.Удалить();	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ОтветОбОшибке(ИнформацияОбОшибке) Экспорт
	
	ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
	ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	
	Результат = Новый Структура;
	Результат.Вставить("Result", "Error");
	Результат.Вставить("ErrorText", КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		
КонецФункции